In [1]:
import pandas as pd
df1= pd.DataFrame({
    "city":["new york", "chicago","orlando","baltimore"],"temperature":[21,14,35,37]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [5]:
df2= pd.DataFrame({
    "city":["chicago","new york","sam francisco"],
    "humidity":[65, 68, 75]
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  sam francisco        75

In [8]:
df3=pd.merge(df1,df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [9]:
df3=pd.merge(df1,df2, on="city", how="outer")
df3

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3  sam francisco          NaN      75.0

In [10]:
df3=pd.merge(df1,df2, on="city", how="right")
df3

            city  temperature  humidity
0        chicago         14.0        65
1       new york         21.0        68
2  sam francisco          NaN        75

In [11]:
df3=pd.merge(df1,df2, on="city", how="outer", indicator=True)
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3  sam francisco          NaN      75.0  right_only

In [24]:
df1= pd.DataFrame({
    "city":["new york", "chicago","orlando","baltimore"],"temperature":[21,14,35,37],
    "humidity":[65,67,71,32]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        67
2    orlando           35        71
3  baltimore           37        32

In [25]:
df2= pd.DataFrame({
    "city":["chicago","new york","sam francisco"],
    "humidity":[65, 68, 75],"temperture":[21,45,10]
})
df2

            city  humidity  temperture
0        chicago        65          21
1       new york        68          45
2  sam francisco        75          10

In [27]:
df3= pd.merge(df1, df2,on="city")
df3

       city  temperature  humidity_x  humidity_y  temperture
0  new york           21          65          68          45
1   chicago           14          67          65          21

In [28]:
df3= pd.merge(df1, df2,on="city", suffixes=('_left','_right'))
df3

       city  temperature  humidity_left  humidity_right  temperture
0  new york           21             65              68          45
1   chicago           14             67              65          21